def rules():
    """
    Правила гри.
    """
    print("""
★    Дешифратор — це логічна гра, в якій дешифратор намагається розгадати таємний код, створений кододавцем. Кододавець, яким буде виступати програма, створює таємний код з чотирьох чисел від 1 до 6.

★    Дешифратор має деяку кількість спроб розгадати код (залежно від обраної складності). На кожному ходу дешифратор робить спробу з 4 чисел. Кододавець позначає спробу знаками + або -.

★    Знак + означає точне збігання: одне з чисел у спробі користувача таке саме, як і одне з чисел у таємному коді та на тій же позиції. Для прикладу:

Таємне число - 1234

Введене число - 6264

Кількість плюсів - 2 (друга та четверта позиція)

★    Знак - означає збіг числа: одне з чисел у спробі таке саме, як і одне з чисел у таємному коді, але на іншій позиції. Наприклад:

Таємне число - 1234

Введене число - 6462

Кількість мінусів - 2 (друга та четверта позиція)

★    Порожнє місце означає, що в таємному числі немає даної цифри.

★    Якщо дешифратор вводить точне число, як таємне число - дешифратор виграє гру. Якщо всі спроби вичерпані - дешифратор програє.

★    Дешифратор також має деяку кількість підказок (залежно від обраної складності). Якщо користувач використовує підказку - він отримує окрему цифру з таємного коду.
    """)
